# SetWaypoint Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathOfTravel..::..SetWaypoint Method
PathOfTravel Class See Also
---
Updates the specified waypoint.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.2
# Syntax
C#
---
```text
public void SetWaypoint(
	XYZ waypoint,
	int index
)
```

Visual Basic
---
```text
Public Sub SetWaypoint ( _
	waypoint As XYZ, _
	index As Integer _
)
```

Visual C++
---
```text
public:
void SetWaypoint(
	XYZ^ waypoint,
	int index
)
```

# ### Parameters
waypoint
    Type: Autodesk.Revit.DB..::..XYZ The new point for the waypoint.
index
    Type: System..::..Int32 The index of the waypoint to update.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Index refers to a non-existent waypoint. -or- This functionality is not available in Revit LT. -or- Cannot perform this operation for a path of travel in a group. |

# See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace